[
  {
    "sentence": "Geoffrey Hinton, a renowned computer scientist, won the Nobel Prize in Physics, and one of his interview clips has caught significant attention.",
    "original": "Geoffrey Hinton, a renowned computer scientist, won the Nobel Prize in Physics, and one of his interview clips has caught significant attention.",
    "translation": "著名的计算机科学家 Geoffrey Hinton 获得了诺贝尔物理学奖，他的一段采访视频引起了广泛关注。",
    "phonetic": "[ˈdʒɛfri ˈhɪntən, ə rɪˈnaʊnd kəmˈpjuːtə ˈsaɪəntɪst, wʌn ðə noʊˈbɛl praɪz ɪn ˈfɪzɪks, ənd wʌn əv hɪz ˈɪntərvjuː klɪps hæz kɔːt sɪɡˈnɪfɪkənt əˈtɛnʃən.]"
  },
  {
    "sentence": "This interview sparked a poll by a YouTuber, asking whether genius simply equates to high intelligence.",
    "original": "This interview sparked a poll by a YouTuber, asking whether genius simply equates to high intelligence.",
    "translation": "这段采访引发了一位 YouTuber 的投票，询问天才是否仅仅等同于高智商。",
    "phonetic": "[ðɪs ˈɪntərvjuː spɑːrkt ə poʊl baɪ ə ˈjuːˌtuːbər, ˈæskɪŋ ˈwɛðər ˈdʒiːniəs ˈsɪmpli ɪˈkweɪts tuː haɪ ɪnˈtɛlɪdʒəns.]"
  },
  {
    "sentence": "Nearly 60% of respondents believed that genius involves a rare cognitive ability, beyond just high intelligence.",
    "original": "Nearly 60% of respondents believed that genius involves a rare cognitive ability, beyond just high intelligence.",
    "translation": "近 60% 的受访者认为天才包含了一种罕见的认知能力，超越了单纯的高智商。",
    "phonetic": "[ˈnɪrli ˈsɪksti pərˈsɛnt əv rɪˈspɑːndənts bɪˈliːvd ðæt ˈdʒiːniəs ɪnˈvɑːlvz ə rɛr ˈkɑːɡnɪtɪv əˈbɪlɪti, bɪˈjɒnd ʤʌst haɪ ɪnˈtɛlɪdʒəns.]"
  },
  {
    "sentence": "About 20% thought genius is synonymous with high intelligence, while 8% felt the question itself was flawed.",
    "original": "About 20% thought genius is synonymous with high intelligence, while 8% felt the question itself was flawed.",
    "translation": "约 20% 的人认为天才与高智商是同义词，而 8% 的人认为问题本身是有缺陷的。",
    "phonetic": "[əˈbaʊt ˈtwɛnti pərˈsɛnt θɔːt ˈdʒiːniəs ɪz sɪˈnɒnɪməs wɪð haɪ ɪnˈtɛlɪdʒəns, waɪl eɪt pərˈsɛnt fɛlt ðə ˈkwɛsʧən ɪtˈsɛlf wəz flɔːd.]"
  },
  {
    "sentence": "Some believe that genius might be linked to unique neural connections in the brain, such as the concept of 'intellectual synesthesia.'",
    "original": "Some believe that genius might be linked to unique neural connections in the brain, such as the concept of 'intellectual synesthesia.'",
    "translation": "有些人认为天才可能与大脑中独特的神经连接有关，例如“智力联觉”的概念。",
    "phonetic": "[sʌm bɪˈliːv ðæt ˈdʒiːniəs maɪt biː lɪŋkt tuː juˈniːk ˈnjʊərəl kəˈnɛkʃənz ɪn ðə breɪn, sʌʧ æz ðə ˈkɒnsɛpt əv 'ˌɪntəˈlɛkʧuəl sɪnɪsˈθiːziə.']"
  },
  {
    "sentence": "This idea refers to certain neurons connecting in a rare and extraordinary way, allowing individuals to perform cognitive feats that most people cannot.",
    "original": "This idea refers to certain neurons connecting in a rare and extraordinary way, allowing individuals to perform cognitive feats that most people cannot.",
    "translation": "这种想法指的是某些神经元以罕见而非凡的方式连接，使个人能够完成大多数人无法做到的认知壮举。",
    "phonetic": "[ðɪs aɪˈdɪə rɪˈfɜːz tuː ˈsɜːtn ˈnjʊərɒnz kəˈnɛktɪŋ ɪn ə rɛər ənd ɪkˈstrɔːdɪnəri weɪ, əˈlaʊɪŋ ˌɪndɪˈvɪdʒuəlz tuː pəˈfɔːrm ˈkɒgnɪtɪv fiːts ðæt moʊst ˈpiːpəl kænˈnɒt.]"
  },
  {
    "sentence": "It suggests that genius isn’t merely about having a high IQ but rather involves a distinctive brain function that exceeds what traditional intelligence tests can measure.",
    "original": "It suggests that genius isn’t merely about having a high IQ but rather involves a distinctive brain function that exceeds what traditional intelligence tests can measure.",
    "translation": "这表明天才不仅仅是拥有高智商，而是涉及一种独特的大脑功能，超出了传统智力测试的测量范围。",
    "phonetic": "[ɪt səˈdʒɛsts ðæt ˈdʒiːniəs ɪznt ˈmɪərli əˈbaʊt ˈhævɪŋ ə haɪ aɪˈkjuː bʌt ˈræðər ɪnˈvɒlvz ə dɪˈstɪŋktɪv breɪn ˈfʌŋkʃən ðæt ɪkˈsiːdz wɒt trəˈdɪʃənl ɪnˈtɛlɪdʒəns tɛsts kæn ˈmɛʒər.]"
  },
  {
    "sentence": "This idea draws from articles like 'Intelligence Killed Genius,' which argue that the first prerequisite for being a genius is the courage to attempt what only a genius would dare, driven by an inner belief of being exceptional.",
    "original": "This idea draws from articles like 'Intelligence Killed Genius,' which argue that the first prerequisite for being a genius is the courage to attempt what only a genius would dare, driven by an inner belief of being exceptional.",
    "translation": "这种想法来源于《智力扼杀天才》一类的文章，文章认为成为天才的首要条件是拥有勇气去尝试只有天才才敢做的事，内心深信自己是与众不同的。",
    "phonetic": "[ðɪs aɪˈdɪə drɔːz frəm ˈɑːtɪklz laɪk 'ɪnˈtɛlɪdʒəns kɪld ˈdʒiːniəs,' wɪʧ ˈɑːgjuː ðæt ðə fɜːst priːˈrɛkwɪzɪt fɔːr biːɪŋ ə ˈdʒiːniəs ɪz ðə ˈkʌrɪdʒ tuː əˈtɛmpt wɒt ˈəʊnli ə ˈdʒiːniəs wʊd deə, ˈdrɪvən baɪ ən ˈɪnə bɪˈliːf əv ˈbiːɪŋ ɪkˈsɛpʃənəl.]"
  },
  {
    "sentence": "The concept of intelligence often kills this feeling because no matter how smart you are, there will always be someone smarter.",
    "original": "The concept of intelligence often kills this feeling because no matter how smart you are, there will always be someone smarter.",
    "translation": "智力的概念往往会扼杀这种感觉，因为无论你多聪明，总会有更聪明的人。",
    "phonetic": "[ðə ˈkɒnsɛpt əv ɪnˈtɛlɪdʒəns ˈɒfən kɪlz ðɪs ˈfiːlɪŋ bɪˈkɒz noʊ ˈmætər haʊ smɑːt juː ɑːr, ðɛər wɪl ˈɔːlweɪz biː ˈsʌmwʌn ˈsmɑːrtər.]"
  },
  {
    "sentence": "True genius, however, isn’t about perfection but rather a kind of imbalance—an imbalance that allows individuals to achieve greatness in specific domains, while appearing relatively ordinary in others.",
    "original": "True genius, however, isn’t about perfection but rather a kind of imbalance—an imbalance that allows individuals to achieve greatness in specific domains, while appearing relatively ordinary in others.",
    "translation": "然而，真正的天才不是关于完美，而是一种不平衡——这种不平衡使个人能够在特定领域取得伟大成就，而在其他方面显得相对普通。",
    "phonetic": "[truː ˈdʒiːniəs, haʊˈɛvə, ɪznt əˈbaʊt pəˈfɛkʃən bʌt ˈræðə ə kaɪnd əv ɪmˈbæləns—ən ɪmˈbæləns ðæt əˈlaʊz ˌɪndɪˈvɪdʒuəlz tuː əˈʧiːv ˈɡreɪtnəs ɪn spəˈsɪfɪk dəˈmeɪnz, waɪl əˈpɪərɪŋ ˈrɛlətɪvli ˈɔːdnri ɪn ˈʌðərz.]"
  },
  {
    "sentence": "It’s this special neural wiring that enables them to excel in their field.",
    "original": "It’s this special neural wiring that enables them to excel in their field.",
    "translation": "正是这种特殊的神经连接使他们在自己的领域中表现卓越。",
    "phonetic": "[ɪts ðɪs ˈspɛʃəl ˈnjʊərəl ˈwaɪərɪŋ ðæt ɪˈneɪbəlz ðɛm tuː ɪkˈsɛl ɪn ðɛər fiːld.]"
  },
  {
    "sentence": "The rise of AI might challenge the notion that intelligence is the defining measure of genius.",
    "original": "The rise of AI might challenge the notion that intelligence is the defining measure of genius.",
    "translation": "人工智能的崛起可能会挑战将智力作为定义天才的标准这一观念。",
    "phonetic": "[ðə raɪz əv eɪ aɪ maɪt ˈʧælɪnʤ ðə ˈnoʊʃən ðæt ɪnˈtɛlɪdʒəns ɪz ðə dɪˈfaɪnɪŋ ˈmɛʒər əv ˈdʒiːniəs.]"
  },
  {
    "sentence": "Overemphasizing intelligence could undermine those with unique cognitive abilities and creative spirits.",
    "original": "Overemphasizing intelligence could undermine those with unique cognitive abilities and creative spirits.",
    "translation": "过分强调智力可能会削弱那些拥有独特认知能力和创造精神的人。",
    "phonetic": "[ˌoʊvərˈɛmfəˌsaɪzɪŋ ɪnˈtɛlɪdʒəns kʊd ˈʌndərˌmaɪn ðoʊz wɪð juˈniːk ˈkɑːɡnɪtɪv əˈbɪlɪtiz ənd kriˈeɪtɪv ˈspɪrɪts.]"
  },
  {
    "sentence": "Hinton’s journey exemplifies this: in the face of widespread skepticism and pessimism towards neural networks, he persisted and ultimately revolutionized AI.",
    "original": "Hinton’s journey exemplifies this: in the face of widespread skepticism and pessimism towards neural networks, he persisted and ultimately revolutionized AI.",
    "translation": "Hinton 的经历证明了这一点：面对对神经网络的广泛质疑和悲观情绪，他坚持不懈，最终彻底改变了人工智能。",
    "phonetic": "[ˈhɪntənz ˈdʒɜːrni ɪɡˈzɛmplɪfaɪz ðɪs: ɪn ðə feɪs əv ˈwaɪdspred ˈskɛptɪsɪzəm ənd ˈpɛsɪˌmɪzəm təˈwɔːrdz ˈnjʊərəl ˈnɛtwɜːrks, hiː pərˈsɪstɪd ənd ˈʌltɪmətli ˌrɛvəˈluːʃənaɪzd eɪ aɪ.]"
  },
  {
    "sentence": "His story highlights the importance of belief and courage, showing that relying solely on intelligence metrics may limit our potential to explore the unknown.",
    "original": "His story highlights the importance of belief and courage, showing that relying solely on intelligence metrics may limit our potential to explore the unknown.",
    "translation": "他的故事强调了信念和勇气的重要性，表明仅仅依赖智力指标可能会限制我们探索未知的潜力。",
    "phonetic": "[hɪz ˈstɔːri ˈhaɪlaɪts ði ɪmˈpɔːrtəns əv bɪˈliːf ənd ˈkʌrɪdʒ, ˈʃoʊɪŋ ðæt rɪˈlaɪɪŋ ˈsoʊli ɒn ɪnˈtɛlɪdʒəns ˈmɛtrɪks meɪ ˈlɪmɪt aʊər pəˈtɛnʃəl tuː ɪkˈsplɔːr ði ʌnˈnoʊn.]"
  },
  {
    "sentence": "True genius lies not in having the highest IQ but in having the audacity to pursue seemingly absurd ideas and bring them to life.",
    "original": "True genius lies not in having the highest IQ but in having the audacity to pursue seemingly absurd ideas and bring them to life.",
    "translation": "真正的天才不在于拥有最高的智商，而在于有勇气追求看似荒谬的想法，并将其付诸实践。",
    "phonetic": "[truː ˈdʒiːniəs laɪz nɒt ɪn ˈhævɪŋ ðə ˈhaɪɪst aɪˈkjuː bʌt ɪn ˈhævɪŋ ði ɔːˈdæsɪti tuː pərˈsjuː ˈsiːmɪŋli æbˈsɜːrd aɪˈdɪəz ənd brɪŋ ðɛm tuː laɪf.]"
  }
]