[
  {
    "sentence": "Hiding from the rain and snow, trying to forget but I won't let go.",
    "original": "Hiding from the rain and snow, trying to forget but I won't let go.",
    "translation": "藏身于雨雪之中，努力忘记，但我怎能就这样离去。",
    "phonetic": "[ˈhaɪdɪŋ frəm ðə reɪn ənd snəʊ, ˈtraɪɪŋ tə fəˈɡɛt bʌt aɪ woʊnt lɛt ɡoʊ.]"
  },
  {
    "sentence": "Looking at a crowded street, listening to my own heart beat.",
    "original": "Looking at a crowded street, listening to my own heart beat.",
    "translation": "看着熙熙攘攘的街道，却只能听见自己的心跳。",
    "phonetic": "[ˈlʊkɪŋ æt ə ˈkraʊdɪd striːt, ˈlɪsənɪŋ tə maɪ oʊn hɑːrt biːt.]"
  },
  {
    "sentence": "So many people all around the world, tell me where do I find someone like you, girl.",
    "original": "So many people all around the world, tell me where do I find someone like you, girl.",
    "translation": "这么多的人在世界上，请告诉我在哪里可以找到像你一样的女孩。",
    "phonetic": "[soʊ ˈmɛni ˈpiːpəl ɔːl əˈraʊnd ðə wɜːrld, tɛl mi wɛr du aɪ faɪnd ˈsʌmwʌn laɪk ju, ɡɜːrl.]"
  },
  {
    "sentence": "Take me to your heart, take me to your soul, give me your hand before I'm old, show me what love is, haven't got a clue, show me that wonders can be true.",
    "original": "Take me to your heart, take me to your soul, give me your hand before I'm old, show me what love is, haven't got a clue, show me that wonders can be true.",
    "translation": "将我留存心间，与你的灵魂相伴，给我你的手，在我老去之前；问情为何物，毫无头绪；让我看到奇迹也可以成为现实。",
    "phonetic": "[teɪk mi tə jɔːr hɑːrt, teɪk mi tə jɔːr soʊl, ɡɪv mi jɔːr hænd bɪˈfɔːr aɪm oʊld, ʃoʊ mi wʌt lʌv ɪz, ˈhævənt ɡɒt ə kluː, ʃoʊ mi ðæt ˈwʌndərz kæn bi truː.]"
  },
  {
    "sentence": "They say nothing lasts forever, we're only here today, love is now or never, bring me far away.",
    "original": "They say nothing lasts forever, we're only here today, love is now or never, bring me far away.",
    "translation": "他们说没有什么是永远的，我们也能此时相守；爱情是勿失良机，请带我一起远走。",
    "phonetic": "[ðeɪ seɪ ˈnʌθɪŋ læsts fəˈrɛvər, wɪr ˈoʊnli hɪr təˈdeɪ, lʌv ɪz naʊ ɔːr ˈnɛvər, brɪŋ mi fɑːr əˈweɪ.]"
  },
  {
    "sentence": "Standing on a mountain high, looking at the moon through a clear blue sky, I should go and see some friends, but they don't really comprehend.",
    "original": "Standing on a mountain high, looking at the moon through a clear blue sky, I should go and see some friends, but they don't really comprehend.",
    "translation": "站在高山之颠，看着月亮高挂于清澈的蓝天；也许我应该去和朋友们在一起，但他们真的不明白我此时的心情。",
    "phonetic": "[ˈstændɪŋ ɒn ə ˈmaʊntən haɪ, ˈlʊkɪŋ æt ðə muːn θruː ə klɪr bluː skaɪ, aɪ ʃʊd ɡoʊ ənd siː səm frɛndz, bʌt ðeɪ doʊnt ˈrɪəli ˌkɑːmprɪˈhɛnd.]"
  },
  {
    "sentence": "Don't need too much talking without saying anything, all I need is someone who makes me wanna sing.",
    "original": "Don't need too much talking without saying anything, all I need is someone who makes me wanna sing.",
    "translation": "不需要繁琐的言语甚至可以一语不发，我仅仅需要一个能让我欢乐而歌的人。",
    "phonetic": "[doʊnt niːd tuː mʌtʃ ˈtɔːkɪŋ wɪˈðaʊt ˈseɪɪŋ ˈɛnɪθɪŋ, ɔːl aɪ niːd ɪz ˈsʌmwʌn huː meɪks mi ˈwɑːnə sɪŋ.]"
  },
  {
    "sentence": "Take me to your heart, take me to your soul, give me your hand and hold me, show me what love is, be my guiding star, it's easy, take me to your heart.",
    "original": "Take me to your heart, take me to your soul, give me your hand and hold me, show me what love is, be my guiding star, it's easy, take me to your heart.",
    "translation": "让我靠近你的心，与你的灵魂相伴，给我你的手拥我入怀；问情为何物，让星辰照亮我路；其实爱我真的很简单。",
    "phonetic": "[teɪk mi tə jɔːr hɑːrt, teɪk mi tə jɔːr soʊl, ɡɪv mi jɔːr hænd ənd hoʊld mi, ʃoʊ mi wʌt lʌv ɪz, bi maɪ ˈɡaɪdɪŋ stɑːr, ɪts ˈiːzi, teɪk mi tə jɔːr hɑːrt.]"
  }
]