[
  {
    "sentence": "<span style=\"color:red;\">W</span>hat you doing? Eh? You readin’? Tring to. I’m not so good at it, either. I’m not surprised.",
    "original": "What you doing? Eh? You readin’? Tring to. I’m not so good at it, either. I’m not surprised.",
    "translation": "你在做什么？诶？你在读书吗？欲读不能。我读书也不怎么样。我并不感到惊讶。",
    "phonetic": "[wʌt ju ˈduːɪŋ? ɛ? ju ˈriːdən? trɪŋ tu. aɪm nɒt soʊ ɡʊd æt ɪt, ˈiːðər. aɪm nɒt sərˈpraɪzd]"
  },
  {
    "sentence": "<span style=\"color:red;\">T</span>hat was a joke. I’m Jimmy Scrivano. You want to see me do a cannonball? I’d rather see you get hit by one, but… Ha. Good one, gorgeous!",
    "original": "That was a joke. I’m Jimmy Scrivano. You want to see me do a cannonball? I’d rather see you get hit by one, but… Ha. Good one, gorgeous!",
    "translation": "那只是个玩笑。我叫吉米·斯克利瓦诺。你想看我跳水炸弹吗？我倒是更愿意看你被炸中，不过……哈。好一个，美女！",
    "phonetic": "[ðæt wəz ə dʒoʊk. aɪm ˈdʒɪmi skriˈvænoʊ. ju wɑnt tə si mi du ə ˈkænənˌbɔl? aɪd ˈræðər si ju ɡɛt hɪt baɪ wʌn, bʌt… hɑ. ɡʊd wʌn, ˈɡɔrdʒəs]"
  },
  {
    "sentence": "<span style=\"color:red;\">O</span>kay, Lily, I’m going to push you one more time. Now don’t kick me, okay? Aah! Oh! Lily! I said don’t kick me. Okay? You know it’s your own fault that’s happening. Why don’t you try standing behind her? You’re an idiot.",
    "original": "Okay, Lily, I’m going to push you one more time. Now don’t kick me, okay? Aah! Oh! Lily! I said don’t kick me. Okay? You know it’s your own fault that’s happening. Why don’t you try standing behind her? You’re an idiot.",
    "translation": "好了，莉莉，我就再推你一次。现在别踢我，好吗？啊！哦！莉莉！我说过别踢我，好吗？你知道这一切都是你自找的。你为什么不试着站在她后面？你真是个白痴。",
    "phonetic": "[oʊˈkeɪ, ˈlɪli, aɪm ˈɡoʊɪŋ tə pʊʃ ju wʌn mɔr taɪm. naʊ doʊnt kɪk mi, oʊˈkeɪ? ɑː! oʊ! ˈlɪli! aɪ sɛd doʊnt kɪk mi. oʊˈkeɪ? ju noʊ ɪts jʊr oʊn fɔlt ðæts ˈhæpənɪŋ. waɪ doʊnt ju traɪ ˈstændɪŋ bɪˈhaɪnd hɜr? jʊr æn ˈɪdiət]"
  },
  {
    "sentence": "<span style=\"color:red;\">O</span>h, really? I ain’t the one getting kicked. Why are you following me? Why are you fighting me here, Gorgeous? This works! Listen, I really, really don’t appreciate you calling me “Gorgeous.”",
    "original": "Oh, really? I ain’t the one getting kicked. Why are you following me? Why are you fighting me here, Gorgeous? This works! Listen, I really, really don’t appreciate you calling me “Gorgeous.”",
    "translation": "哦，真的吗？被踢的可不是我。你为什么跟踪我？你为什么在这里和我打架，美女？这招管用！听着，我真的非常不喜欢你叫我‘美女’。",
    "phonetic": "[oʊ, ˈrɪli? aɪ eɪnt ðə wʌn ˈɡɛtɪŋ kɪkt. waɪ ɑr ju ˈfɑloʊɪŋ mi? waɪ ɑr ju ˈfaɪtɪŋ mi hɪr, ˈɡɔrdʒəs? ðɪs wɜrks! ˈlɪsən, aɪ ˈrɪli, ˈrɪli doʊnt əˈpriːʃieɪt ju ˈkoʊlɪŋ mi “ˈɡɔrdʒəs”]"
  },
  {
    "sentence": "<span style=\"color:red;\">N</span>ot a problem. See you around, Sunshine. You kissed the boy. No. The boy kissed me. Okay, Lily! The boy kissed me.",
    "original": "Not a problem. See you around, Sunshine. You kissed the boy. No. The boy kissed me. Okay, Lily! The boy kissed me.",
    "translation": "没问题。回头见，阳光。你吻了那个男孩。不，那男孩吻了我。好了，莉莉！那男孩吻了我。",
    "phonetic": "[nɑt ə ˈprɑbləm. si ju əˈraʊnd, ˈsʌnʃaɪn. ju kɪst ðə bɔɪ. noʊ. ðə bɔɪ kɪst mi. oʊˈkeɪ, ˈlɪli! ðə bɔɪ kɪst mi]"
  },
  {
    "sentence": "<span style=\"color:red;\">W</span>e need to talk. What? You stole my first kiss. What are you talkin’ about? I had it all planned out.",
    "original": "We need to talk. What? You stole my first kiss. What are you talkin’ about? I had it all planned out.",
    "translation": "我们需要谈谈。什么？你偷走了我的初吻。你在说什么？我早已计划好一切。",
    "phonetic": "[wi nid tə tɔk. wʌt? ju stoʊl maɪ fɜrst kɪs. wʌt ɑr ju ˈtɔkɪn əˈbaʊt? aɪ hæd ɪt ɔl plænd aʊt]"
  },
  {
    "sentence": "<span style=\"color:red;\">I</span>t was supposed to be special, someone with a high GPA and a bright future, not a Mario Brother. There. Now we’re even. Well, keep it. I don’t, I don’t want it anymore. What am I doing?",
    "original": "It was supposed to be special, someone with a high GPA and a bright future, not a Mario Brother. There. Now we’re even. Well, keep it. I don’t, I don’t want it anymore. What am I doing?",
    "translation": "我的初吻本该是特别的，应该属于一个高GPA、前途光明的人，而不是马里奥兄弟。好了。现在我们扯平了。你看着吧。我不，我不想要了。我到底在干什么？",
    "phonetic": "[ɪt wəz səˈpoʊzd tə bi ˈspɛʃəl, ˈsʌmwʌn wɪð ə haɪ ˌdʒiːpiːˈeɪ ənd ə braɪt ˈfjuʧər, nɑt ə ˈmɑrioʊ ˈbrʌðər. ðɛr. naʊ wɪr ˈivən. wɛl, kip ɪt. aɪ doʊnt, aɪ doʊnt wɑnt ɪt ˈɛniˌmɔr. wʌt æm aɪ ˈduːɪŋ?]"
  },
  {
    "sentence": "<span style=\"color:red;\">I</span> looked it up. The distance between our house is 2443 miles. Yeah, but, you know, on some maps it’s like, Pfft! This big. God, you’re stupid.",
    "original": "I looked it up. The distance between our house is 2443 miles. Yeah, but, you know, on some maps it’s like, Pfft! This big. God, you’re stupid.",
    "translation": "我查过了。我们房子之间的直线距离是2443英里。是啊，不过，你知道，有些地图上就显示成这样——啪！这么大。天哪，你真蠢。",
    "phonetic": "[aɪ lʊkt ɪt ʌp. ðə ˈdɪstəns bɪˈtwiːn aʊər haʊs ɪz 2443 maɪlz. jæ, bʌt, ju noʊ, ɑn sʌm mæps ɪts laɪk, pft! ðɪs bɪɡ. ɡɑd, jʊr ˈstjuːpɪd]"
  }
]